customSequences/in/getWeather_json_to_xml.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="getWeather_json_to_xml" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
  <log level="custom" separator=",">
    <property name="getWeather" value="getWeather"/>
  </log>
  <payloadFactory media-type="xml">
    <format>
      <soap:Envelope
        xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.webserviceX.NET">
        <soap:Header/>
        <soap:Body>
          <web:GetWeather>
            <web:CityName>$2</web:CityName>
            <web:CountryName>$1</web:CountryName>
          </web:GetWeather>
        </soap:Body>
      </soap:Envelope>
    </format>
    <args>
      <arg evaluator="xml" expression="//request/CountryName"/>
      <arg evaluator="xml" expression="//request/CityName"/>
    </args>
  </payloadFactory>
  <property name="messageType" scope="axis2" type="STRING" value="application/soap+xml"/>
</sequence>
